package com.itheima._01方法概述;
/*
    方法定义的通用格式：
        public static 返回值类型 方法名(参数列表){
            方法体;
            return 值;
        }
        返回值类型：根据需求定义
        参数列表：参数可以有一个，可以有多个，可以没有，如果有多个参数使用逗号隔开
        方法体：方法的功能
        return ：用来返回方法最终结果，返回值的数据类型要和方法的返回值类型一致
    注意事项：
        1.方法不能嵌套定义
        2.方法在定义完成后，不会自己执行，需要被调用才执行
        3.方法名要做到见名知义，符合小驼峰的命名规范
        4.如果方法没有返回值，return语句可以省略不写 ，如果一定要写，只能 return;

        5.如果方法没有返回值，只能直接调用
        6.如果方法有返回值，可以直接调用,没有意义不推荐，还可以赋值调用，输出调用
        7.return语句下面，不能编写代码，因为永远执行不到，属于无效的代码
 */
public class Demo08方法定义的通用格式 {
    public static void main(String[] args) {

    }
}
